app/Models/Menu_model.php

    public function berita()
    {
        $builder = $this->db->table('berita');
        $builder->select('berita.id_kategori,berita.icon, berita.ringkasan, berita.gambar, kategori.nama_kategori, kategori.slug_kategori');
        $builder->join('kategori', 'kategori.id_kategori = berita.id_kategori');
        $builder->where(array('status_berita'    => 'Publish','jenis_berita' => 'Berita'));
        $builder->groupBy('berita.id_kategori');
        $query = $builder->get();
---
SELECT `berita`.`id_kategori`, `berita`.`icon`, `berita`.`ringkasan`, `berita`.`gambar`, `kategori`.`nama_kategori`, `kategori`.`slug_kategori`
FROM `berita`
JOIN `kategori` ON `kategori`.`id_kategori` = `berita`.`id_kategori`
WHERE `status_berita` = 'Publish'
AND `jenis_berita` = 'Berita'
GROUP BY `berita`.`id_kategori`

    public function profil($jenis_berita)
    {
        $builder = $this->db->table('berita');
        $builder->select('berita.judul_berita, berita.hits,berita.icon, berita.ringkasan, berita.gambar, berita.slug_berita, berita.id_berita');
        $builder->where(array('status_berita'    => 'Publish','jenis_berita' => $jenis_berita));
        $query = $builder->get();
---
SELECT `berita`.`judul_berita`, `berita`.`hits`, `berita`.`icon`, `berita`.`ringkasan`, `berita`.`gambar`, `berita`.`slug_berita`, `berita`.`id_berita`
FROM `berita`
WHERE `status_berita` = 'Publish'
AND `jenis_berita` = 'Profil'

    public function cabang($status_cabang)
    {
        $builder = $this->db->table('cabang');
        $builder->select('*');
        $builder->where('status_cabang',$status_cabang);
        $builder->orderBy('nama_cabang','ASC');
        $builder->limit(10);
        $query = $builder->get();
---
SELECT *
FROM `cabang`
WHERE `status_cabang` = 'status_cabang'
ORDER BY `nama_cabang` ASC
 LIMIT 10