app/Models/Patient_model.php

SELECT *
FROM `patient`
ORDER BY `patient`.`patient_id` DESC
 LIMIT 25
---
    public function paginasi_admin($limit,$start)
    {
        $builder = $this->db->table('patient');
        $builder->select('*');
        $builder->limit($limit,$start);
        $builder->orderBy('patient.patient_id','DESC');
        $query = $builder->get();

SELECT *
FROM `patient`
WHERE `patient_id` = '3'
ORDER BY `patient`.`patient_id` DESC
---
    public function detail($patient_id)
    {
        $builder = $this->db->table('patient');
        $builder->where('patient_id',$patient_id);
        $builder->orderBy('patient.patient_id','DESC');
        $query = $builder->get();